openmv/openmv/src/hal/mimxrt/MIMXRT1062/drivers/mimxrt_pads.c
// THIS FILE IS AUTO-GENERATED DO NOT EDIT.

/*
 * This file is part of the OpenMV project.
 *
 * Copyright (c) 2023 Ibrahim Abdelkader <iabdalkader@openmv.io>
 * Copyright (c) 2023 Kwabena W. Agyeman <kwagyeman@openmv.io>
 *
 * This work is licensed under the MIT license, see the file LICENSE for details.
 */
#include "omv_gpio.h"
#include "fsl_gpio.h"
#include "fsl_iomuxc.h"
#include "mimxrt_pads.h"

static omv_gpio_irq_descr_t gpio_irq_descr_gpio1[32] = { NULL };
static omv_gpio_irq_descr_t gpio_irq_descr_gpio2[32] = { NULL };
static omv_gpio_irq_descr_t gpio_irq_descr_gpio3[28] = { NULL };
static omv_gpio_irq_descr_t gpio_irq_descr_gpio4[32] = { NULL };
static omv_gpio_irq_descr_t gpio_irq_descr_gpio5[3] = { NULL };
static omv_gpio_irq_descr_t gpio_irq_descr_gpio10[22] = { NULL };

omv_gpio_irq_descr_t *const gpio_irq_descr_table[11] = {
    [1] = gpio_irq_descr_gpio1,
    [2] = gpio_irq_descr_gpio2,
    [3] = gpio_irq_descr_gpio3,
    [4] = gpio_irq_descr_gpio4,
    [5] = gpio_irq_descr_gpio5,
    [10] = gpio_irq_descr_gpio10,
};

static const imxrt_pad_af_t imxrt_pad_EMC_00_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8494, 0 },    // FLEXPWM4
    { 2, 0x8500, 1 },    // LPSPI2
    { 3, 0x860C, 0 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXIO1
};
const imxrt_pad_t imxrt_pad_EMC_00 = { GPIO4, 0, 0x401F, 0x8014, 0x8204, 5, imxrt_pad_EMC_00_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_01_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x0000, 0 },    // FLEXPWM4
    { 2, 0x84FC, 1 },    // LPSPI2
    { 3, 0x8610, 0 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXIO1
};
const imxrt_pad_t imxrt_pad_EMC_01 = { GPIO4, 1, 0x401F, 0x8018, 0x8208, 5, imxrt_pad_EMC_01_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_02_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8498, 0 },    // FLEXPWM4
    { 2, 0x8508, 1 },    // LPSPI2
    { 3, 0x8614, 0 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXIO1
};
const imxrt_pad_t imxrt_pad_EMC_02 = { GPIO4, 2, 0x401F, 0x801C, 0x820C, 5, imxrt_pad_EMC_02_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_03_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x0000, 0 },    // FLEXPWM4
    { 2, 0x8504, 1 },    // LPSPI2
    { 3, 0x8618, 0 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXIO1
};
const imxrt_pad_t imxrt_pad_EMC_03 = { GPIO4, 3, 0x401F, 0x8020, 0x8210, 5, imxrt_pad_EMC_03_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_04_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x849C, 0 },    // FLEXPWM4
    { 2, 0x0000, 0 },    // SAI2
    { 3, 0x861C, 0 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXIO1
};
const imxrt_pad_t imxrt_pad_EMC_04 = { GPIO4, 4, 0x401F, 0x8024, 0x8214, 5, imxrt_pad_EMC_04_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_05_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x0000, 0 },    // FLEXPWM4
    { 2, 0x85C4, 0 },    // SAI2
    { 3, 0x8620, 0 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXIO1
};
const imxrt_pad_t imxrt_pad_EMC_05 = { GPIO4, 5, 0x401F, 0x8028, 0x8218, 5, imxrt_pad_EMC_05_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_06_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8478, 0 },    // FLEXPWM2
    { 2, 0x85C0, 0 },    // SAI2
    { 3, 0x8624, 0 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXIO1
};
const imxrt_pad_t imxrt_pad_EMC_06 = { GPIO4, 6, 0x401F, 0x802C, 0x821C, 5, imxrt_pad_EMC_06_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_07_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8488, 0 },    // FLEXPWM2
    { 2, 0x85B0, 0 },    // SAI2
    { 3, 0x8628, 0 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXIO1
};
const imxrt_pad_t imxrt_pad_EMC_07 = { GPIO4, 7, 0x401F, 0x8030, 0x8220, 5, imxrt_pad_EMC_07_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_08_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x847C, 0 },    // FLEXPWM2
    { 2, 0x85B8, 0 },    // SAI2
    { 3, 0x862C, 0 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXIO1
};
const imxrt_pad_t imxrt_pad_EMC_08 = { GPIO4, 8, 0x401F, 0x8034, 0x8224, 5, imxrt_pad_EMC_08_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_09_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x848C, 0 },    // FLEXPWM2
    { 2, 0x85BC, 0 },    // SAI2
    { 3, 0x0000, 0 },    // FLEXCAN2
    { 4, 0x0000, 0 },    // FLEXIO1
    { 8, 0x0000, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_09 = { GPIO4, 9, 0x401F, 0x8038, 0x8228, 6, imxrt_pad_EMC_09_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_10_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8480, 0 },    // FLEXPWM2
    { 2, 0x85B4, 0 },    // SAI2
    { 3, 0x8450, 0 },    // FLEXCAN2
    { 4, 0x0000, 0 },    // FLEXIO1
    { 8, 0x0000, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_10 = { GPIO4, 10, 0x401F, 0x803C, 0x822C, 6, imxrt_pad_EMC_10_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_11_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8490, 0 },    // FLEXPWM2
    { 2, 0x84E8, 0 },    // LPI2C4
    { 3, 0x0000, 0 },    // USDHC2
    { 4, 0x0000, 0 },    // FLEXIO1
    { 8, 0x0000, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_11 = { GPIO4, 11, 0x401F, 0x8040, 0x8230, 6, imxrt_pad_EMC_11_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_12_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8640, 0 },    // XBAR1
    { 2, 0x84E4, 0 },    // LPI2C4
    { 3, 0x85D8, 0 },    // USDHC1
    { 4, 0x8454, 1 },    // FLEXPWM1
    { 8, 0x8754, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_12 = { GPIO4, 12, 0x401F, 0x8044, 0x8234, 6, imxrt_pad_EMC_12_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_13_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8650, 1 },    // XBAR1
    { 2, 0x853C, 1 },    // LPUART3
    { 3, 0x0000, 0 },    // MQS
    { 4, 0x8464, 1 },    // FLEXPWM1
    { 8, 0x8740, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_13 = { GPIO4, 13, 0x401F, 0x8048, 0x8238, 6, imxrt_pad_EMC_13_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_14_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8654, 0 },    // XBAR1
    { 2, 0x8538, 1 },    // LPUART3
    { 3, 0x0000, 0 },    // MQS
    { 4, 0x0000, 0 },    // LPSPI2
    { 8, 0x8744, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_14 = { GPIO4, 14, 0x401F, 0x804C, 0x823C, 6, imxrt_pad_EMC_14_AF };

