openmv/openmv/src/hal/mimxrt/MIMXRT1062/drivers/mimxrt_pads.c
static const imxrt_pad_af_t imxrt_pad_EMC_15_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8634, 0 },    // XBAR1
    { 2, 0x8534, 0 },    // LPUART3
    { 3, 0x0000, 0 },    // SPDIF
    { 4, 0x857C, 0 },    // QTIMER3
    { 8, 0x8748, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_15 = { GPIO4, 15, 0x401F, 0x8050, 0x8240, 6, imxrt_pad_EMC_15_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_16_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8658, 0 },    // XBAR1
    { 2, 0x0000, 0 },    // LPUART3
    { 3, 0x85C8, 1 },    // SPDIF
    { 4, 0x8580, 1 },    // QTIMER3
    { 8, 0x874C, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_16 = { GPIO4, 16, 0x401F, 0x8054, 0x8244, 6, imxrt_pad_EMC_16_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_17_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x84A0, 0 },    // FLEXPWM4
    { 2, 0x0000, 0 },    // LPUART4
    { 3, 0x0000, 0 },    // FLEXCAN1
    { 4, 0x8584, 0 },    // QTIMER3
};
const imxrt_pad_t imxrt_pad_EMC_17 = { GPIO4, 17, 0x401F, 0x8058, 0x8248, 5, imxrt_pad_EMC_17_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_18_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x0000, 0 },    // FLEXPWM4
    { 2, 0x0000, 0 },    // LPUART4
    { 3, 0x844C, 1 },    // FLEXCAN1
    { 4, 0x8588, 0 },    // QTIMER3
    { 6, 0x0000, 0 },    // SNVS
};
const imxrt_pad_t imxrt_pad_EMC_18 = { GPIO4, 18, 0x401F, 0x805C, 0x824C, 6, imxrt_pad_EMC_18_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_19_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8474, 1 },    // FLEXPWM2
    { 2, 0x8544, 1 },    // LPUART4
    { 3, 0x8438, 0 },    // ENET
    { 4, 0x856C, 0 },    // QTIMER2
    { 6, 0x0000, 0 },    // SNVS
};
const imxrt_pad_t imxrt_pad_EMC_19 = { GPIO4, 19, 0x401F, 0x8060, 0x8250, 6, imxrt_pad_EMC_19_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_20_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8484, 1 },    // FLEXPWM2
    { 2, 0x8540, 1 },    // LPUART4
    { 3, 0x8434, 0 },    // ENET
    { 4, 0x8570, 0 },    // QTIMER2
};
const imxrt_pad_t imxrt_pad_EMC_20 = { GPIO4, 20, 0x401F, 0x8064, 0x8254, 5, imxrt_pad_EMC_20_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_21_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x0000, 0 },    // FLEXPWM3
    { 2, 0x84E0, 0 },    // LPI2C3
    { 3, 0x0000, 0 },    // ENET
    { 4, 0x8574, 0 },    // QTIMER2
};
const imxrt_pad_t imxrt_pad_EMC_21 = { GPIO4, 21, 0x401F, 0x8068, 0x8258, 5, imxrt_pad_EMC_21_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_22_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x0000, 0 },    // FLEXPWM3
    { 2, 0x84DC, 0 },    // LPI2C3
    { 3, 0x0000, 0 },    // ENET
    { 4, 0x8578, 0 },    // QTIMER2
    { 8, 0x0000, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_22 = { GPIO4, 22, 0x401F, 0x806C, 0x825C, 6, imxrt_pad_EMC_22_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_23_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8458, 0 },    // FLEXPWM1
    { 2, 0x854C, 0 },    // LPUART5
    { 3, 0x843C, 0 },    // ENET
    { 4, 0x875C, 0 },    // GPT1
    { 8, 0x872C, 1 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_23 = { GPIO4, 23, 0x401F, 0x8070, 0x8260, 6, imxrt_pad_EMC_23_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_24_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8468, 0 },    // FLEXPWM1
    { 2, 0x8548, 0 },    // LPUART5
    { 3, 0x0000, 0 },    // ENET
    { 4, 0x8758, 0 },    // GPT1
    { 8, 0x0000, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_24 = { GPIO4, 24, 0x401F, 0x8074, 0x8264, 6, imxrt_pad_EMC_24_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_25_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x845C, 0 },    // FLEXPWM1
    { 2, 0x8554, 0 },    // LPUART6
    { 3, 0x8448, 0 },    // ENET
    { 4, 0x842C, 0 },    // ENET
    { 8, 0x8750, 1 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_25 = { GPIO4, 25, 0x401F, 0x8078, 0x8268, 6, imxrt_pad_EMC_25_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_26_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x846C, 0 },    // FLEXPWM1
    { 2, 0x8550, 0 },    // LPUART6
    { 3, 0x8440, 0 },    // ENET
    { 4, 0x0000, 0 },    // FLEXIO1
    { 8, 0x8730, 1 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_26 = { GPIO4, 26, 0x401F, 0x807C, 0x826C, 6, imxrt_pad_EMC_26_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_27_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8460, 0 },    // FLEXPWM1
    { 2, 0x0000, 0 },    // LPUART5
    { 3, 0x84F0, 0 },    // LPSPI1
    { 4, 0x0000, 0 },    // FLEXIO1
    { 8, 0x8734, 1 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_27 = { GPIO4, 27, 0x401F, 0x8080, 0x8270, 6, imxrt_pad_EMC_27_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_28_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8470, 0 },    // FLEXPWM1
    { 2, 0x0000, 0 },    // LPUART5
    { 3, 0x84F8, 0 },    // LPSPI1
    { 4, 0x0000, 0 },    // FLEXIO1
    { 8, 0x8738, 1 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_28 = { GPIO4, 28, 0x401F, 0x8084, 0x8274, 6, imxrt_pad_EMC_28_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_29_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x0000, 0 },    // FLEXPWM3
    { 2, 0x0000, 0 },    // LPUART6
    { 3, 0x84F4, 0 },    // LPSPI1
    { 4, 0x0000, 0 },    // FLEXIO1
    { 8, 0x873C, 1 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_EMC_29 = { GPIO4, 29, 0x401F, 0x8088, 0x8278, 6, imxrt_pad_EMC_29_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_30_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x0000, 0 },    // FLEXPWM3
    { 2, 0x0000, 0 },    // LPUART6
    { 3, 0x84EC, 1 },    // LPSPI1
    { 4, 0x0000, 0 },    // CSI
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_EMC_30 = { GPIO4, 30, 0x401F, 0x808C, 0x827C, 6, imxrt_pad_EMC_30_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_31_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x0000, 0 },    // FLEXPWM3
    { 2, 0x855C, 1 },    // LPUART7
    { 3, 0x0000, 0 },    // LPSPI1
    { 4, 0x0000, 0 },    // CSI
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_EMC_31 = { GPIO4, 31, 0x401F, 0x8090, 0x8280, 6, imxrt_pad_EMC_31_AF };

