openmv/openmv/src/hal/mimxrt/MIMXRT1062/drivers/mimxrt_pads.c
static const imxrt_pad_af_t imxrt_pad_EMC_32_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x0000, 0 },    // FLEXPWM3
    { 2, 0x8558, 1 },    // LPUART7
    { 3, 0x83FC, 4 },    // CCM
    { 4, 0x0000, 0 },    // CSI
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_EMC_32 = { GPIO3, 18, 0x401F, 0x8094, 0x8284, 6, imxrt_pad_EMC_32_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_33_AF[7] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x0000, 0 },    // FLEXPWM3
    { 2, 0x0000, 0 },    // USDHC1
    { 3, 0x8778, 0 },    // SAI3
    { 4, 0x0000, 0 },    // CSI
    { 8, 0x8728, 0 },    // ENET2
    { 9, 0x870C, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_EMC_33 = { GPIO3, 19, 0x401F, 0x8098, 0x8288, 7, imxrt_pad_EMC_33_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_34_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x0000, 0 },    // FLEXPWM3
    { 2, 0x0000, 0 },    // USDHC1
    { 3, 0x877C, 0 },    // SAI3
    { 4, 0x0000, 0 },    // CSI
    { 8, 0x8720, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_EMC_34 = { GPIO3, 20, 0x401F, 0x809C, 0x828C, 6, imxrt_pad_EMC_34_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_35_AF[7] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8630, 0 },    // XBAR1
    { 2, 0x0000, 0 },    // GPT1
    { 3, 0x8774, 0 },    // SAI3
    { 4, 0x0000, 0 },    // CSI
    { 6, 0x85D4, 0 },    // USDHC1
    { 8, 0x8714, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_EMC_35 = { GPIO3, 21, 0x401F, 0x80A0, 0x8290, 7, imxrt_pad_EMC_35_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_36_AF[8] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8638, 0 },    // XBAR1
    { 2, 0x0000, 0 },    // GPT1
    { 3, 0x0000, 0 },    // SAI3
    { 4, 0x0000, 0 },    // CSI
    { 6, 0x85D8, 1 },    // USDHC1
    { 8, 0x8718, 0 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXCAN3
};
const imxrt_pad_t imxrt_pad_EMC_36 = { GPIO3, 22, 0x401F, 0x80A4, 0x8294, 8, imxrt_pad_EMC_36_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_37_AF[8] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x863C, 0 },    // XBAR1
    { 2, 0x0000, 0 },    // GPT1
    { 3, 0x8770, 0 },    // SAI3
    { 4, 0x0000, 0 },    // CSI
    { 6, 0x8608, 0 },    // USDHC2
    { 8, 0x871C, 0 },    // ENET2
    { 9, 0x878C, 0 },    // FLEXCAN3
};
const imxrt_pad_t imxrt_pad_EMC_37 = { GPIO3, 23, 0x401F, 0x80A8, 0x8298, 8, imxrt_pad_EMC_37_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_38_AF[7] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8454, 2 },    // FLEXPWM1
    { 2, 0x8564, 2 },    // LPUART8
    { 3, 0x8780, 0 },    // SAI3
    { 4, 0x0000, 0 },    // CSI
    { 6, 0x0000, 0 },    // USDHC2
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_EMC_38 = { GPIO3, 24, 0x401F, 0x80AC, 0x829C, 7, imxrt_pad_EMC_38_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_39_AF[8] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8464, 2 },    // FLEXPWM1
    { 2, 0x8560, 2 },    // LPUART8
    { 3, 0x8784, 0 },    // SAI3
    { 4, 0x0000, 0 },    // WDOG1
    { 6, 0x85E0, 1 },    // USDHC2
    { 8, 0x8710, 0 },    // ENET2
    { 9, 0x8788, 1 },    // SEMC
};
const imxrt_pad_t imxrt_pad_EMC_39 = { GPIO3, 25, 0x401F, 0x80B0, 0x82A0, 8, imxrt_pad_EMC_39_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_40_AF[7] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8768, 0 },    // GPT2
    { 2, 0x0000, 0 },    // LPSPI1
    { 3, 0x85CC, 1 },    // USB
    { 4, 0x0000, 0 },    // ENET
    { 6, 0x0000, 0 },    // USDHC2
    { 9, 0x0000, 0 },    // SEMC
};
const imxrt_pad_t imxrt_pad_EMC_40 = { GPIO3, 26, 0x401F, 0x80B4, 0x82A4, 7, imxrt_pad_EMC_40_AF };

static const imxrt_pad_af_t imxrt_pad_EMC_41_AF[6] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x8764, 0 },    // GPT2
    { 2, 0x0000, 0 },    // LPSPI1
    { 3, 0x0000, 0 },    // USB
    { 4, 0x8430, 1 },    // ENET
    { 6, 0x0000, 0 },    // USDHC1
};
const imxrt_pad_t imxrt_pad_EMC_41 = { GPIO3, 27, 0x401F, 0x80B8, 0x82A8, 6, imxrt_pad_EMC_41_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_00_AF[7] = {
    { 0, 0x8474, 2 },    // FLEXPWM2
    { 1, 0x8644, 0 },    // XBAR1
    { 2, 0x0000, 0 },    // REF
    { 3, 0x83F8, 0 },    // USB
    { 4, 0x0000, 0 },    // LPI2C1
    { 6, 0x0000, 0 },    // USDHC1
    { 7, 0x8510, 0 },    // LPSPI3
};
const imxrt_pad_t imxrt_pad_AD_B0_00 = { GPIO1, 0, 0x401F, 0x80BC, 0x82AC, 7, imxrt_pad_AD_B0_00_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_01_AF[7] = {
    { 0, 0x8484, 2 },    // FLEXPWM2
    { 1, 0x8648, 0 },    // XBAR1
    { 2, 0x0000, 0 },    // REF
    { 3, 0x83F4, 0 },    // USB
    { 4, 0x0000, 0 },    // LPI2C1
    { 6, 0x0000, 0 },    // EWM
    { 7, 0x8518, 0 },    // LPSPI3
};
const imxrt_pad_t imxrt_pad_AD_B0_01 = { GPIO1, 1, 0x401F, 0x80C0, 0x82B0, 7, imxrt_pad_AD_B0_01_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_02_AF[7] = {
    { 0, 0x0000, 0 },    // FLEXCAN2
    { 1, 0x864C, 0 },    // XBAR1
    { 2, 0x8554, 1 },    // LPUART6
    { 3, 0x0000, 0 },    // USB
    { 4, 0x0000, 0 },    // FLEXPWM1
    { 6, 0x0000, 0 },    // LPI2C1
    { 7, 0x8514, 0 },    // LPSPI3
};
const imxrt_pad_t imxrt_pad_AD_B0_02 = { GPIO1, 2, 0x401F, 0x80C4, 0x82B4, 7, imxrt_pad_AD_B0_02_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_03_AF[7] = {
    { 0, 0x8450, 1 },    // FLEXCAN2
    { 1, 0x862C, 1 },    // XBAR1
    { 2, 0x8550, 1 },    // LPUART6
    { 3, 0x85D0, 0 },    // USB
    { 4, 0x0000, 0 },    // FLEXPWM1
    { 6, 0x0000, 0 },    // REF
    { 7, 0x850C, 0 },    // LPSPI3
};
const imxrt_pad_t imxrt_pad_AD_B0_03 = { GPIO1, 3, 0x401F, 0x80C8, 0x82B8, 7, imxrt_pad_AD_B0_03_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_04_AF[7] = {
    { 0, 0x0000, 0 },    // SRC
    { 1, 0x0000, 0 },    // MQS
    { 2, 0x0000, 0 },    // ENET
    { 3, 0x85C4, 1 },    // SAI2
    { 4, 0x841C, 1 },    // CSI
    { 6, 0x0000, 0 },    // PIT
    { 7, 0x0000, 0 },    // LPSPI3
};
const imxrt_pad_t imxrt_pad_AD_B0_04 = { GPIO1, 4, 0x401F, 0x80CC, 0x82BC, 7, imxrt_pad_AD_B0_04_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_05_AF[7] = {
    { 0, 0x0000, 0 },    // SRC
    { 1, 0x0000, 0 },    // MQS
    { 2, 0x0000, 0 },    // ENET
    { 3, 0x85C0, 1 },    // SAI2
    { 4, 0x8418, 1 },    // CSI
    { 6, 0x862C, 2 },    // XBAR1
    { 7, 0x0000, 0 },    // LPSPI3
};
const imxrt_pad_t imxrt_pad_AD_B0_05 = { GPIO1, 5, 0x401F, 0x80D0, 0x82C0, 7, imxrt_pad_AD_B0_05_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_06_AF[7] = {
    { 0, 0x0000, 0 },    // JTAG
    { 1, 0x0000, 0 },    // GPT2
    { 2, 0x0000, 0 },    // ENET
    { 3, 0x85B4, 1 },    // SAI2
    { 4, 0x8414, 1 },    // CSI
    { 6, 0x8630, 1 },    // XBAR1
    { 7, 0x0000, 0 },    // LPSPI3
};
const imxrt_pad_t imxrt_pad_AD_B0_06 = { GPIO1, 6, 0x401F, 0x80D4, 0x82C4, 7, imxrt_pad_AD_B0_06_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_07_AF[7] = {
    { 0, 0x0000, 0 },    // JTAG
    { 1, 0x0000, 0 },    // GPT2
    { 2, 0x0000, 0 },    // ENET
    { 3, 0x85BC, 1 },    // SAI2
    { 4, 0x8410, 1 },    // CSI
    { 6, 0x8654, 1 },    // XBAR1
    { 7, 0x0000, 0 },    // ENET
};
const imxrt_pad_t imxrt_pad_AD_B0_07 = { GPIO1, 7, 0x401F, 0x80D8, 0x82C8, 7, imxrt_pad_AD_B0_07_AF };

