openmv/openmv/src/hal/mimxrt/MIMXRT1062/drivers/mimxrt_pads.c
static const imxrt_pad_af_t imxrt_pad_AD_B0_08_AF[7] = {
    { 0, 0x0000, 0 },    // JTAG
    { 1, 0x0000, 0 },    // GPT2
    { 2, 0x0000, 0 },    // ENET
    { 3, 0x85B8, 1 },    // SAI2
    { 4, 0x840C, 1 },    // CSI
    { 6, 0x8634, 1 },    // XBAR1
    { 7, 0x0000, 0 },    // ENET
};
const imxrt_pad_t imxrt_pad_AD_B0_08 = { GPIO1, 8, 0x401F, 0x80DC, 0x82CC, 7, imxrt_pad_AD_B0_08_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_09_AF[8] = {
    { 0, 0x0000, 0 },    // JTAG
    { 1, 0x8474, 3 },    // FLEXPWM2
    { 2, 0x0000, 0 },    // ENET
    { 3, 0x0000, 0 },    // SAI2
    { 4, 0x8408, 1 },    // CSI
    { 6, 0x8658, 1 },    // XBAR1
    { 7, 0x876C, 0 },    // GPT2
    { 9, 0x8788, 2 },    // SEMC
};
const imxrt_pad_t imxrt_pad_AD_B0_09 = { GPIO1, 9, 0x401F, 0x80E0, 0x82D0, 8, imxrt_pad_AD_B0_09_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_10_AF[9] = {
    { 0, 0x0000, 0 },    // JTAG
    { 1, 0x8454, 3 },    // FLEXPWM1
    { 2, 0x0000, 0 },    // ENET
    { 3, 0x85B0, 1 },    // SAI2
    { 4, 0x8404, 1 },    // CSI
    { 6, 0x8638, 1 },    // XBAR1
    { 7, 0x0000, 0 },    // ENET
    { 8, 0x0000, 0 },    // FLEXCAN3
    { 9, 0x0000, 0 },    // ARM
};
const imxrt_pad_t imxrt_pad_AD_B0_10 = { GPIO1, 10, 0x401F, 0x80E4, 0x82D4, 9, imxrt_pad_AD_B0_10_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_11_AF[9] = {
    { 0, 0x0000, 0 },    // JTAG
    { 1, 0x8464, 3 },    // FLEXPWM1
    { 2, 0x0000, 0 },    // ENET
    { 3, 0x0000, 0 },    // WDOG1
    { 4, 0x8400, 1 },    // CSI
    { 6, 0x863C, 1 },    // XBAR1
    { 7, 0x8444, 1 },    // ENET
    { 8, 0x878C, 2 },    // FLEXCAN3
    { 9, 0x0000, 0 },    // SEMC
};
const imxrt_pad_t imxrt_pad_AD_B0_11 = { GPIO1, 11, 0x401F, 0x80E8, 0x82D8, 9, imxrt_pad_AD_B0_11_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_12_AF[7] = {
    { 0, 0x84E4, 1 },    // LPI2C4
    { 1, 0x83FC, 1 },    // CCM
    { 2, 0x0000, 0 },    // LPUART1
    { 3, 0x0000, 0 },    // WDOG2
    { 4, 0x0000, 0 },    // FLEXPWM1
    { 6, 0x0000, 0 },    // ENET
    { 7, 0x8568, 0 },    // NMI
};
const imxrt_pad_t imxrt_pad_AD_B0_12 = { GPIO1, 12, 0x401F, 0x80EC, 0x82DC, 7, imxrt_pad_AD_B0_12_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_13_AF[7] = {
    { 0, 0x84E8, 1 },    // LPI2C4
    { 1, 0x8760, 0 },    // GPT1
    { 2, 0x0000, 0 },    // LPUART1
    { 3, 0x0000, 0 },    // EWM
    { 4, 0x0000, 0 },    // FLEXPWM1
    { 6, 0x0000, 0 },    // ENET
    { 7, 0x0000, 0 },    // REF
};
const imxrt_pad_t imxrt_pad_AD_B0_13 = { GPIO1, 13, 0x401F, 0x80F0, 0x82E0, 7, imxrt_pad_AD_B0_13_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_14_AF[7] = {
    { 0, 0x85CC, 0 },    // USB
    { 1, 0x8640, 1 },    // XBAR1
    { 2, 0x0000, 0 },    // LPUART1
    { 3, 0x0000, 0 },    // ENET
    { 4, 0x8428, 0 },    // CSI
    { 6, 0x0000, 0 },    // FLEXCAN2
    { 8, 0x0000, 0 },    // FLEXCAN3
};
const imxrt_pad_t imxrt_pad_AD_B0_14 = { GPIO1, 14, 0x401F, 0x80F4, 0x82E4, 7, imxrt_pad_AD_B0_14_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B0_15_AF[8] = {
    { 0, 0x0000, 0 },    // USB
    { 1, 0x8650, 0 },    // XBAR1
    { 2, 0x0000, 0 },    // LPUART1
    { 3, 0x8444, 0 },    // ENET
    { 4, 0x8420, 0 },    // CSI
    { 6, 0x8450, 2 },    // FLEXCAN2
    { 7, 0x0000, 0 },    // WDOG1
    { 8, 0x878C, 1 },    // FLEXCAN3
};
const imxrt_pad_t imxrt_pad_AD_B0_15 = { GPIO1, 15, 0x401F, 0x80F8, 0x82E8, 8, imxrt_pad_AD_B0_15_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_00_AF[9] = {
    { 0, 0x83F8, 1 },    // USB
    { 1, 0x857C, 1 },    // QTIMER3
    { 2, 0x0000, 0 },    // LPUART2
    { 3, 0x84CC, 1 },    // LPI2C1
    { 4, 0x0000, 0 },    // WDOG1
    { 6, 0x85D8, 2 },    // USDHC1
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x0000, 0 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_00 = { GPIO1, 16, 0x401F, 0x80FC, 0x82EC, 9, imxrt_pad_AD_B1_00_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_01_AF[9] = {
    { 0, 0x0000, 0 },    // USB
    { 1, 0x8580, 0 },    // QTIMER3
    { 2, 0x0000, 0 },    // LPUART2
    { 3, 0x84D0, 1 },    // LPI2C1
    { 4, 0x83FC, 2 },    // CCM
    { 6, 0x0000, 0 },    // USDHC1
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x8724, 0 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_01 = { GPIO1, 17, 0x401F, 0x8100, 0x82F0, 9, imxrt_pad_AD_B1_01_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_02_AF[9] = {
    { 0, 0x83F4, 1 },    // USB
    { 1, 0x8584, 1 },    // QTIMER3
    { 2, 0x8530, 1 },    // LPUART2
    { 3, 0x0000, 0 },    // SPDIF
    { 4, 0x0000, 0 },    // ENET
    { 6, 0x85D4, 1 },    // USDHC1
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x876C, 1 },    // GPT2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_02 = { GPIO1, 18, 0x401F, 0x8104, 0x82F4, 9, imxrt_pad_AD_B1_02_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_03_AF[9] = {
    { 0, 0x85D0, 1 },    // USB
    { 1, 0x8588, 1 },    // QTIMER3
    { 2, 0x852C, 1 },    // LPUART2
    { 3, 0x85C8, 0 },    // SPDIF
    { 4, 0x0000, 0 },    // ENET
    { 6, 0x85E0, 0 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x8764, 1 },    // GPT2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_03 = { GPIO1, 19, 0x401F, 0x8108, 0x82F8, 9, imxrt_pad_AD_B1_03_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_04_AF[9] = {
    { 0, 0x84C4, 1 },    // FLEXSPIB
    { 1, 0x0000, 0 },    // ENET
    { 2, 0x8534, 1 },    // LPUART3
    { 3, 0x0000, 0 },    // SPDIF
    { 4, 0x8424, 0 },    // CSI
    { 6, 0x85E8, 1 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x8768, 1 },    // GPT2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_04 = { GPIO1, 20, 0x401F, 0x810C, 0x82FC, 9, imxrt_pad_AD_B1_04_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_05_AF[9] = {
    { 0, 0x84C0, 1 },    // FLEXSPIB
    { 1, 0x8430, 0 },    // ENET
    { 2, 0x0000, 0 },    // LPUART3
    { 3, 0x0000, 0 },    // SPDIF
    { 4, 0x0000, 0 },    // CSI
    { 6, 0x85EC, 1 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x0000, 0 },    // GPT2
    { 9, 0x0000, 0 },    // FLEXIO3
};
