openmv/openmv/src/hal/mimxrt/MIMXRT1062/drivers/mimxrt_pads.c
const imxrt_pad_t imxrt_pad_AD_B1_05 = { GPIO1, 21, 0x401F, 0x8110, 0x8300, 9, imxrt_pad_AD_B1_05_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_06_AF[9] = {
    { 0, 0x84BC, 1 },    // FLEXSPIB
    { 1, 0x84E0, 2 },    // LPI2C3
    { 2, 0x853C, 0 },    // LPUART3
    { 3, 0x0000, 0 },    // SPDIF
    { 4, 0x8428, 1 },    // CSI
    { 6, 0x85F0, 1 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x0000, 0 },    // GPT2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_06 = { GPIO1, 22, 0x401F, 0x8114, 0x8304, 9, imxrt_pad_AD_B1_06_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_07_AF[9] = {
    { 0, 0x84B8, 1 },    // FLEXSPIB
    { 1, 0x84DC, 2 },    // LPI2C3
    { 2, 0x8538, 0 },    // LPUART3
    { 3, 0x0000, 0 },    // SPDIF
    { 4, 0x8420, 1 },    // CSI
    { 6, 0x85F4, 1 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x0000, 0 },    // GPT2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_07 = { GPIO1, 23, 0x401F, 0x8118, 0x8308, 9, imxrt_pad_AD_B1_07_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_08_AF[8] = {
    { 0, 0x0000, 0 },    // FLEXSPIA
    { 1, 0x8494, 1 },    // FLEXPWM4
    { 2, 0x0000, 0 },    // FLEXCAN1
    { 3, 0x83FC, 3 },    // CCM
    { 4, 0x841C, 0 },    // CSI
    { 6, 0x85E4, 1 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_08 = { GPIO1, 24, 0x401F, 0x811C, 0x830C, 8, imxrt_pad_AD_B1_08_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_09_AF[8] = {
    { 0, 0x84A4, 1 },    // FLEXSPIA
    { 1, 0x8498, 1 },    // FLEXPWM4
    { 2, 0x844C, 2 },    // FLEXCAN1
    { 3, 0x858C, 1 },    // SAI1
    { 4, 0x8418, 0 },    // CSI
    { 6, 0x85DC, 1 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_09 = { GPIO1, 25, 0x401F, 0x8120, 0x8310, 8, imxrt_pad_AD_B1_09_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_10_AF[9] = {
    { 0, 0x84B4, 1 },    // FLEXSPIA
    { 1, 0x0000, 0 },    // WDOG1
    { 2, 0x8564, 1 },    // LPUART8
    { 3, 0x85A4, 1 },    // SAI1
    { 4, 0x8414, 0 },    // CSI
    { 6, 0x8608, 1 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x0000, 0 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_10 = { GPIO1, 26, 0x401F, 0x8124, 0x8314, 9, imxrt_pad_AD_B1_10_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_11_AF[9] = {
    { 0, 0x84B0, 1 },    // FLEXSPIA
    { 1, 0x0000, 0 },    // EWM
    { 2, 0x8560, 1 },    // LPUART8
    { 3, 0x8590, 1 },    // SAI1
    { 4, 0x8410, 0 },    // CSI
    { 6, 0x0000, 0 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x0000, 0 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_11 = { GPIO1, 27, 0x401F, 0x8128, 0x8318, 9, imxrt_pad_AD_B1_11_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_12_AF[9] = {
    { 0, 0x84AC, 1 },    // FLEXSPIA
    { 1, 0x0000, 0 },    // ACMP
    { 2, 0x850C, 1 },    // LPSPI3
    { 3, 0x8594, 1 },    // SAI1
    { 4, 0x840C, 0 },    // CSI
    { 6, 0x85F8, 1 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x0000, 0 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_12 = { GPIO1, 28, 0x401F, 0x812C, 0x831C, 9, imxrt_pad_AD_B1_12_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_13_AF[9] = {
    { 0, 0x84A8, 1 },    // FLEXSPIA
    { 1, 0x0000, 0 },    // ACMP
    { 2, 0x8514, 1 },    // LPSPI3
    { 3, 0x0000, 0 },    // SAI1
    { 4, 0x8408, 0 },    // CSI
    { 6, 0x85FC, 1 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x0000, 0 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_13 = { GPIO1, 29, 0x401F, 0x8130, 0x8320, 9, imxrt_pad_AD_B1_13_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_14_AF[9] = {
    { 0, 0x84C8, 1 },    // FLEXSPIA
    { 1, 0x0000, 0 },    // ACMP
    { 2, 0x8518, 1 },    // LPSPI3
    { 3, 0x85A8, 1 },    // SAI1
    { 4, 0x8404, 0 },    // CSI
    { 6, 0x8600, 1 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x0000, 0 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_14 = { GPIO1, 30, 0x401F, 0x8134, 0x8324, 9, imxrt_pad_AD_B1_14_AF };

static const imxrt_pad_af_t imxrt_pad_AD_B1_15_AF[9] = {
    { 0, 0x0000, 0 },    // FLEXSPIA
    { 1, 0x0000, 0 },    // ACMP
    { 2, 0x8510, 1 },    // LPSPI3
    { 3, 0x85AC, 1 },    // SAI1
    { 4, 0x8400, 0 },    // CSI
    { 6, 0x8604, 1 },    // USDHC2
    { 7, 0x0000, 0 },    // KPP
    { 8, 0x0000, 0 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_AD_B1_15 = { GPIO1, 31, 0x401F, 0x8138, 0x8328, 9, imxrt_pad_AD_B1_15_AF };

static const imxrt_pad_af_t imxrt_pad_B0_00_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x0000, 0 },    // QTIMER1
    { 2, 0x0000, 0 },    // MQS
    { 3, 0x851C, 0 },    // LPSPI4
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SEMC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_00 = { GPIO2, 0, 0x401F, 0x813C, 0x832C, 7, imxrt_pad_B0_00_AF };

static const imxrt_pad_af_t imxrt_pad_B0_01_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x0000, 0 },    // QTIMER1
    { 2, 0x0000, 0 },    // MQS
    { 3, 0x8524, 0 },    // LPSPI4
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SEMC
    { 8, 0x8710, 1 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_01 = { GPIO2, 1, 0x401F, 0x8140, 0x8330, 7, imxrt_pad_B0_01_AF };

static const imxrt_pad_af_t imxrt_pad_B0_02_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x0000, 0 },    // QTIMER1
    { 2, 0x0000, 0 },    // FLEXCAN1
    { 3, 0x8528, 0 },    // LPSPI4
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SEMC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_02 = { GPIO2, 2, 0x401F, 0x8144, 0x8334, 7, imxrt_pad_B0_02_AF };

static const imxrt_pad_af_t imxrt_pad_B0_03_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x856C, 1 },    // QTIMER2
    { 2, 0x844C, 3 },    // FLEXCAN1
    { 3, 0x8520, 0 },    // LPSPI4
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // WDOG2
    { 8, 0x8724, 1 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_03 = { GPIO2, 3, 0x401F, 0x8148, 0x8338, 7, imxrt_pad_B0_03_AF };

static const imxrt_pad_af_t imxrt_pad_B0_04_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x8570, 1 },    // QTIMER2
    { 2, 0x84D4, 1 },    // LPI2C2
    { 3, 0x0000, 0 },    // ARM
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SRC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_04 = { GPIO2, 4, 0x401F, 0x814C, 0x833C, 7, imxrt_pad_B0_04_AF };

static const imxrt_pad_af_t imxrt_pad_B0_05_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x8574, 1 },    // QTIMER2
    { 2, 0x84D8, 1 },    // LPI2C2
    { 3, 0x0000, 0 },    // ARM
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SRC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_05 = { GPIO2, 5, 0x401F, 0x8150, 0x8340, 7, imxrt_pad_B0_05_AF };

