openmv/openmv/src/hal/mimxrt/MIMXRT1062/drivers/mimxrt_pads.c
static const imxrt_pad_af_t imxrt_pad_B0_06_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x857C, 2 },    // QTIMER3
    { 2, 0x8478, 1 },    // FLEXPWM2
    { 3, 0x0000, 0 },    // ARM
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SRC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_06 = { GPIO2, 6, 0x401F, 0x8154, 0x8344, 7, imxrt_pad_B0_06_AF };

static const imxrt_pad_af_t imxrt_pad_B0_07_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x8580, 2 },    // QTIMER3
    { 2, 0x8488, 1 },    // FLEXPWM2
    { 3, 0x0000, 0 },    // ARM
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SRC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_07 = { GPIO2, 7, 0x401F, 0x8158, 0x8348, 7, imxrt_pad_B0_07_AF };

static const imxrt_pad_af_t imxrt_pad_B0_08_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x8584, 2 },    // QTIMER3
    { 2, 0x847C, 1 },    // FLEXPWM2
    { 3, 0x853C, 2 },    // LPUART3
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SRC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_08 = { GPIO2, 8, 0x401F, 0x815C, 0x834C, 7, imxrt_pad_B0_08_AF };

static const imxrt_pad_af_t imxrt_pad_B0_09_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x0000, 0 },    // QTIMER4
    { 2, 0x848C, 1 },    // FLEXPWM2
    { 3, 0x8538, 2 },    // LPUART3
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SRC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_09 = { GPIO2, 9, 0x401F, 0x8160, 0x8350, 7, imxrt_pad_B0_09_AF };

static const imxrt_pad_af_t imxrt_pad_B0_10_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x0000, 0 },    // QTIMER4
    { 2, 0x8480, 1 },    // FLEXPWM2
    { 3, 0x8598, 1 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SRC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_10 = { GPIO2, 10, 0x401F, 0x8164, 0x8354, 7, imxrt_pad_B0_10_AF };

static const imxrt_pad_af_t imxrt_pad_B0_11_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x0000, 0 },    // QTIMER4
    { 2, 0x8490, 1 },    // FLEXPWM2
    { 3, 0x859C, 1 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SRC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_11 = { GPIO2, 11, 0x401F, 0x8168, 0x8358, 7, imxrt_pad_B0_11_AF };

static const imxrt_pad_af_t imxrt_pad_B0_12_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x0000, 0 },    // XBAR1
    { 2, 0x0000, 0 },    // ARM
    { 3, 0x85A0, 1 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SRC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_12 = { GPIO2, 12, 0x401F, 0x816C, 0x835C, 7, imxrt_pad_B0_12_AF };

static const imxrt_pad_af_t imxrt_pad_B0_13_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x0000, 0 },    // XBAR1
    { 2, 0x0000, 0 },    // ARM
    { 3, 0x858C, 2 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SRC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_13 = { GPIO2, 13, 0x401F, 0x8170, 0x8360, 7, imxrt_pad_B0_13_AF };

static const imxrt_pad_af_t imxrt_pad_B0_14_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x0000, 0 },    // XBAR1
    { 2, 0x0000, 0 },    // ARM
    { 3, 0x85A4, 2 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SRC
    { 8, 0x0000, 0 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_14 = { GPIO2, 14, 0x401F, 0x8174, 0x8364, 7, imxrt_pad_B0_14_AF };

static const imxrt_pad_af_t imxrt_pad_B0_15_AF[8] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x0000, 0 },    // XBAR1
    { 2, 0x0000, 0 },    // ARM
    { 3, 0x8590, 2 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // SRC
    { 8, 0x8728, 2 },    // ENET2
    { 9, 0x870C, 2 },    // ENET2
};
const imxrt_pad_t imxrt_pad_B0_15 = { GPIO2, 15, 0x401F, 0x8178, 0x8368, 8, imxrt_pad_B0_15_AF };

static const imxrt_pad_af_t imxrt_pad_B1_00_AF[8] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x8644, 1 },    // XBAR1
    { 2, 0x8544, 2 },    // LPUART4
    { 3, 0x8594, 2 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x8454, 4 },    // FLEXPWM1
    { 8, 0x8720, 2 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_00 = { GPIO2, 16, 0x401F, 0x817C, 0x836C, 8, imxrt_pad_B1_00_AF };

static const imxrt_pad_af_t imxrt_pad_B1_01_AF[8] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x8648, 1 },    // XBAR1
    { 2, 0x8540, 2 },    // LPUART4
    { 3, 0x0000, 0 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x8464, 4 },    // FLEXPWM1
    { 8, 0x8714, 2 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_01 = { GPIO2, 17, 0x401F, 0x8180, 0x8370, 8, imxrt_pad_B1_01_AF };

static const imxrt_pad_af_t imxrt_pad_B1_02_AF[8] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x864C, 1 },    // XBAR1
    { 2, 0x0000, 0 },    // LPSPI4
    { 3, 0x85A8, 2 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x8474, 4 },    // FLEXPWM2
    { 8, 0x8718, 2 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_02 = { GPIO2, 18, 0x401F, 0x8184, 0x8374, 8, imxrt_pad_B1_02_AF };

static const imxrt_pad_af_t imxrt_pad_B1_03_AF[8] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x862C, 3 },    // XBAR1
    { 2, 0x0000, 0 },    // LPSPI4
    { 3, 0x85AC, 2 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x8484, 3 },    // FLEXPWM2
    { 8, 0x871C, 2 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_03 = { GPIO2, 19, 0x401F, 0x8188, 0x8378, 8, imxrt_pad_B1_03_AF };

static const imxrt_pad_af_t imxrt_pad_B1_04_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x851C, 1 },    // LPSPI4
    { 2, 0x0000, 0 },    // CSI
    { 3, 0x8434, 1 },    // ENET
    { 4, 0x0000, 0 },    // FLEXIO2
    { 8, 0x8760, 1 },    // GPT1
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_04 = { GPIO2, 20, 0x401F, 0x818C, 0x837C, 7, imxrt_pad_B1_04_AF };

static const imxrt_pad_af_t imxrt_pad_B1_05_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x8524, 1 },    // LPSPI4
    { 2, 0x0000, 0 },    // CSI
    { 3, 0x8438, 1 },    // ENET
    { 4, 0x0000, 0 },    // FLEXIO2
    { 8, 0x8758, 1 },    // GPT1
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_05 = { GPIO2, 21, 0x401F, 0x8190, 0x8380, 7, imxrt_pad_B1_05_AF };

static const imxrt_pad_af_t imxrt_pad_B1_06_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x8528, 1 },    // LPSPI4
    { 2, 0x0000, 0 },    // CSI
    { 3, 0x843C, 1 },    // ENET
    { 4, 0x0000, 0 },    // FLEXIO2
    { 8, 0x875C, 1 },    // GPT1
    { 9, 0x0000, 0 },    // FLEXIO3
};
