openmv/openmv/src/hal/mimxrt/MIMXRT1062/drivers/mimxrt_pads.c
const imxrt_pad_t imxrt_pad_B1_06 = { GPIO2, 22, 0x401F, 0x8194, 0x8384, 7, imxrt_pad_B1_06_AF };

static const imxrt_pad_af_t imxrt_pad_B1_07_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x8520, 1 },    // LPSPI4
    { 2, 0x0000, 0 },    // CSI
    { 3, 0x0000, 0 },    // ENET
    { 4, 0x0000, 0 },    // FLEXIO2
    { 8, 0x0000, 0 },    // GPT1
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_07 = { GPIO2, 23, 0x401F, 0x8198, 0x8388, 7, imxrt_pad_B1_07_AF };

static const imxrt_pad_af_t imxrt_pad_B1_08_AF[8] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x0000, 0 },    // QTIMER1
    { 2, 0x0000, 0 },    // CSI
    { 3, 0x0000, 0 },    // ENET
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // FLEXCAN2
    { 8, 0x0000, 0 },    // GPT1
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_08 = { GPIO2, 24, 0x401F, 0x819C, 0x838C, 8, imxrt_pad_B1_08_AF };

static const imxrt_pad_af_t imxrt_pad_B1_09_AF[8] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x8578, 1 },    // QTIMER2
    { 2, 0x0000, 0 },    // CSI
    { 3, 0x0000, 0 },    // ENET
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x8450, 3 },    // FLEXCAN2
    { 8, 0x0000, 0 },    // GPT1
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_09 = { GPIO2, 25, 0x401F, 0x81A0, 0x8390, 8, imxrt_pad_B1_09_AF };

static const imxrt_pad_af_t imxrt_pad_B1_10_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x8588, 2 },    // QTIMER3
    { 2, 0x0000, 0 },    // CSI
    { 3, 0x8448, 1 },    // ENET
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x842C, 1 },    // ENET
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_10 = { GPIO2, 26, 0x401F, 0x81A4, 0x8394, 7, imxrt_pad_B1_10_AF };

static const imxrt_pad_af_t imxrt_pad_B1_11_AF[7] = {
    { 0, 0x0000, 0 },    // LCD
    { 1, 0x0000, 0 },    // QTIMER4
    { 2, 0x0000, 0 },    // CSI
    { 3, 0x8440, 1 },    // ENET
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // LPSPI4
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_11 = { GPIO2, 27, 0x401F, 0x81A8, 0x8398, 7, imxrt_pad_B1_11_AF };

static const imxrt_pad_af_t imxrt_pad_B1_12_AF[6] = {
    { 1, 0x854C, 1 },    // LPUART5
    { 2, 0x8424, 1 },    // CSI
    { 3, 0x8444, 2 },    // ENET
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x85D4, 2 },    // USDHC1
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_12 = { GPIO2, 28, 0x401F, 0x81AC, 0x839C, 6, imxrt_pad_B1_12_AF };

static const imxrt_pad_af_t imxrt_pad_B1_13_AF[8] = {
    { 0, 0x0000, 0 },    // WDOG1
    { 1, 0x8548, 1 },    // LPUART5
    { 2, 0x8428, 2 },    // CSI
    { 3, 0x0000, 0 },    // ENET
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x85D8, 3 },    // USDHC1
    { 8, 0x8788, 3 },    // SEMC
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_13 = { GPIO2, 29, 0x401F, 0x81B0, 0x83A0, 8, imxrt_pad_B1_13_AF };

static const imxrt_pad_af_t imxrt_pad_B1_14_AF[8] = {
    { 0, 0x0000, 0 },    // ENET
    { 1, 0x849C, 1 },    // FLEXPWM4
    { 2, 0x8420, 2 },    // CSI
    { 3, 0x860C, 1 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // USDHC1
    { 8, 0x0000, 0 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_14 = { GPIO2, 30, 0x401F, 0x81B4, 0x83A4, 8, imxrt_pad_B1_14_AF };

static const imxrt_pad_af_t imxrt_pad_B1_15_AF[8] = {
    { 0, 0x8430, 2 },    // ENET
    { 1, 0x84A0, 1 },    // FLEXPWM4
    { 2, 0x0000, 0 },    // CSI
    { 3, 0x8610, 1 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXIO2
    { 6, 0x0000, 0 },    // USDHC1
    { 8, 0x0000, 0 },    // ENET2
    { 9, 0x0000, 0 },    // FLEXIO3
};
const imxrt_pad_t imxrt_pad_B1_15 = { GPIO2, 31, 0x401F, 0x81B8, 0x83A8, 8, imxrt_pad_B1_15_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B0_00_AF[8] = {
    { 0, 0x0000, 0 },    // USDHC1
    { 1, 0x8458, 1 },    // FLEXPWM1
    { 2, 0x84DC, 1 },    // LPI2C3
    { 3, 0x8614, 1 },    // XBAR1
    { 4, 0x84F0, 1 },    // LPSPI1
    { 6, 0x0000, 0 },    // FLEXSPIA
    { 8, 0x0000, 0 },    // ENET2
    { 9, 0x8788, 0 },    // SEMC
};
const imxrt_pad_t imxrt_pad_SD_B0_00 = { GPIO3, 12, 0x401F, 0x81BC, 0x83AC, 8, imxrt_pad_SD_B0_00_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B0_01_AF[8] = {
    { 0, 0x0000, 0 },    // USDHC1
    { 1, 0x8468, 1 },    // FLEXPWM1
    { 2, 0x84E0, 1 },    // LPI2C3
    { 3, 0x8618, 1 },    // XBAR1
    { 4, 0x84EC, 0 },    // LPSPI1
    { 6, 0x0000, 0 },    // FLEXSPIB
    { 8, 0x8728, 1 },    // ENET2
    { 9, 0x870C, 1 },    // ENET2
};
const imxrt_pad_t imxrt_pad_SD_B0_01 = { GPIO3, 13, 0x401F, 0x81C0, 0x83B0, 8, imxrt_pad_SD_B0_01_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B0_02_AF[7] = {
    { 0, 0x0000, 0 },    // USDHC1
    { 1, 0x845C, 1 },    // FLEXPWM1
    { 2, 0x0000, 0 },    // LPUART8
    { 3, 0x861C, 1 },    // XBAR1
    { 4, 0x84F8, 1 },    // LPSPI1
    { 8, 0x8720, 1 },    // ENET2
    { 9, 0x0000, 0 },    // SEMC
};
const imxrt_pad_t imxrt_pad_SD_B0_02 = { GPIO3, 14, 0x401F, 0x81C4, 0x83B4, 7, imxrt_pad_SD_B0_02_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B0_03_AF[7] = {
    { 0, 0x0000, 0 },    // USDHC1
    { 1, 0x846C, 1 },    // FLEXPWM1
    { 2, 0x0000, 0 },    // LPUART8
    { 3, 0x8620, 1 },    // XBAR1
    { 4, 0x84F4, 1 },    // LPSPI1
    { 8, 0x8714, 1 },    // ENET2
    { 9, 0x0000, 0 },    // SEMC
};
const imxrt_pad_t imxrt_pad_SD_B0_03 = { GPIO3, 15, 0x401F, 0x81C8, 0x83B8, 7, imxrt_pad_SD_B0_03_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B0_04_AF[7] = {
    { 0, 0x0000, 0 },    // USDHC1
    { 1, 0x8460, 1 },    // FLEXPWM1
    { 2, 0x8564, 0 },    // LPUART8
    { 3, 0x8624, 1 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXSPIB
    { 6, 0x0000, 0 },    // CCM
    { 8, 0x8718, 1 },    // ENET2
};
const imxrt_pad_t imxrt_pad_SD_B0_04 = { GPIO3, 16, 0x401F, 0x81CC, 0x83BC, 7, imxrt_pad_SD_B0_04_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B0_05_AF[7] = {
    { 0, 0x0000, 0 },    // USDHC1
    { 1, 0x8470, 1 },    // FLEXPWM1
    { 2, 0x8560, 0 },    // LPUART8
    { 3, 0x8628, 1 },    // XBAR1
    { 4, 0x0000, 0 },    // FLEXSPIB
    { 6, 0x0000, 0 },    // CCM
    { 8, 0x871C, 1 },    // ENET2
};
