openmv/openmv/src/hal/mimxrt/MIMXRT1062/drivers/mimxrt_pads.c
const imxrt_pad_t imxrt_pad_SD_B0_05 = { GPIO3, 17, 0x401F, 0x81D0, 0x83C0, 7, imxrt_pad_SD_B0_05_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B1_00_AF[6] = {
    { 0, 0x85F4, 0 },    // USDHC2
    { 1, 0x84C4, 0 },    // FLEXSPIB
    { 2, 0x8454, 0 },    // FLEXPWM1
    { 3, 0x8598, 0 },    // SAI1
    { 4, 0x8544, 0 },    // LPUART4
    { 8, 0x8778, 1 },    // SAI3
};
const imxrt_pad_t imxrt_pad_SD_B1_00 = { GPIO3, 0, 0x401F, 0x81D4, 0x83C4, 6, imxrt_pad_SD_B1_00_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B1_01_AF[6] = {
    { 0, 0x85F0, 0 },    // USDHC2
    { 1, 0x84C0, 0 },    // FLEXSPIB
    { 2, 0x8464, 0 },    // FLEXPWM1
    { 3, 0x859C, 0 },    // SAI1
    { 4, 0x8540, 0 },    // LPUART4
    { 8, 0x0000, 0 },    // SAI3
};
const imxrt_pad_t imxrt_pad_SD_B1_01 = { GPIO3, 1, 0x401F, 0x81D8, 0x83C8, 6, imxrt_pad_SD_B1_01_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B1_02_AF[7] = {
    { 0, 0x85EC, 0 },    // USDHC2
    { 1, 0x84BC, 0 },    // FLEXSPIB
    { 2, 0x8474, 0 },    // FLEXPWM2
    { 3, 0x85A0, 0 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXCAN1
    { 6, 0x0000, 0 },    // CCM
    { 8, 0x8784, 1 },    // SAI3
};
const imxrt_pad_t imxrt_pad_SD_B1_02 = { GPIO3, 2, 0x401F, 0x81DC, 0x83CC, 7, imxrt_pad_SD_B1_02_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B1_03_AF[7] = {
    { 0, 0x85E8, 0 },    // USDHC2
    { 1, 0x84B8, 0 },    // FLEXSPIB
    { 2, 0x8484, 0 },    // FLEXPWM2
    { 3, 0x858C, 0 },    // SAI1
    { 4, 0x844C, 0 },    // FLEXCAN1
    { 6, 0x83FC, 0 },    // CCM
    { 8, 0x8780, 1 },    // SAI3
};
const imxrt_pad_t imxrt_pad_SD_B1_03 = { GPIO3, 3, 0x401F, 0x81E0, 0x83D0, 7, imxrt_pad_SD_B1_03_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B1_04_AF[7] = {
    { 0, 0x85DC, 0 },    // USDHC2
    { 1, 0x0000, 0 },    // FLEXSPIB
    { 2, 0x84CC, 0 },    // LPI2C1
    { 3, 0x85A4, 0 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXSPIA
    { 6, 0x0000, 0 },    // CCM
    { 8, 0x8770, 1 },    // SAI3
};
const imxrt_pad_t imxrt_pad_SD_B1_04 = { GPIO3, 4, 0x401F, 0x81E4, 0x83D4, 7, imxrt_pad_SD_B1_04_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B1_05_AF[6] = {
    { 0, 0x85E4, 0 },    // USDHC2
    { 1, 0x84A4, 0 },    // FLEXSPIA
    { 2, 0x84D0, 0 },    // LPI2C1
    { 3, 0x8590, 0 },    // SAI1
    { 4, 0x0000, 0 },    // FLEXSPIB
    { 8, 0x877C, 1 },    // SAI3
};
const imxrt_pad_t imxrt_pad_SD_B1_05 = { GPIO3, 5, 0x401F, 0x81E8, 0x83D8, 6, imxrt_pad_SD_B1_05_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B1_06_AF[6] = {
    { 0, 0x0000, 0 },    // USDHC2
    { 1, 0x0000, 0 },    // FLEXSPIA
    { 2, 0x0000, 0 },    // LPUART7
    { 3, 0x8594, 0 },    // SAI1
    { 4, 0x84FC, 0 },    // LPSPI2
    { 8, 0x8774, 1 },    // SAI3
};
const imxrt_pad_t imxrt_pad_SD_B1_06 = { GPIO3, 6, 0x401F, 0x81EC, 0x83DC, 6, imxrt_pad_SD_B1_06_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B1_07_AF[5] = {
    { 0, 0x0000, 0 },    // SEMC
    { 1, 0x84C8, 0 },    // FLEXSPIA
    { 2, 0x0000, 0 },    // LPUART7
    { 3, 0x0000, 0 },    // SAI1
    { 4, 0x8500, 0 },    // LPSPI2
};
const imxrt_pad_t imxrt_pad_SD_B1_07 = { GPIO3, 7, 0x401F, 0x81F0, 0x83E0, 5, imxrt_pad_SD_B1_07_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B1_08_AF[6] = {
    { 0, 0x85F8, 0 },    // USDHC2
    { 1, 0x84A8, 0 },    // FLEXSPIA
    { 2, 0x855C, 0 },    // LPUART7
    { 3, 0x85A8, 0 },    // SAI1
    { 4, 0x8508, 0 },    // LPSPI2
    { 6, 0x0000, 0 },    // SEMC
};
const imxrt_pad_t imxrt_pad_SD_B1_08 = { GPIO3, 8, 0x401F, 0x81F4, 0x83E4, 6, imxrt_pad_SD_B1_08_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B1_09_AF[5] = {
    { 0, 0x85FC, 0 },    // USDHC2
    { 1, 0x84AC, 0 },    // FLEXSPIA
    { 2, 0x8558, 0 },    // LPUART7
    { 3, 0x85AC, 0 },    // SAI1
    { 4, 0x8504, 0 },    // LPSPI2
};
const imxrt_pad_t imxrt_pad_SD_B1_09 = { GPIO3, 9, 0x401F, 0x81F8, 0x83E8, 5, imxrt_pad_SD_B1_09_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B1_10_AF[5] = {
    { 0, 0x8600, 0 },    // USDHC2
    { 1, 0x84B0, 0 },    // FLEXSPIA
    { 2, 0x852C, 0 },    // LPUART2
    { 3, 0x84D8, 0 },    // LPI2C2
    { 4, 0x0000, 0 },    // LPSPI2
};
const imxrt_pad_t imxrt_pad_SD_B1_10 = { GPIO3, 10, 0x401F, 0x81FC, 0x83EC, 5, imxrt_pad_SD_B1_10_AF };

static const imxrt_pad_af_t imxrt_pad_SD_B1_11_AF[5] = {
    { 0, 0x8604, 0 },    // USDHC2
    { 1, 0x84B4, 0 },    // FLEXSPIA
    { 2, 0x8530, 0 },    // LPUART2
    { 3, 0x84D4, 0 },    // LPI2C2
    { 4, 0x0000, 0 },    // LPSPI2
};
const imxrt_pad_t imxrt_pad_SD_B1_11 = { GPIO3, 11, 0x401F, 0x8200, 0x83F0, 5, imxrt_pad_SD_B1_11_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_00_AF[0] = {
};
const imxrt_pad_t imxrt_pad_SPI_B0_00 = { GPIO10, 0, 0x401F, 0x865C, 0x86B4, 0, imxrt_pad_SPI_B0_00_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_01_AF[1] = {
    { 0, 0x8754, 1 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B0_01 = { GPIO10, 1, 0x401F, 0x8660, 0x86B8, 1, imxrt_pad_SPI_B0_01_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_02_AF[1] = {
    { 0, 0x8730, 2 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B0_02 = { GPIO10, 2, 0x401F, 0x8664, 0x86BC, 1, imxrt_pad_SPI_B0_02_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_03_AF[1] = {
    { 0, 0x8748, 1 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B0_03 = { GPIO10, 3, 0x401F, 0x8668, 0x86C0, 1, imxrt_pad_SPI_B0_03_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_04_AF[1] = {
    { 0, 0x874C, 1 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B0_04 = { GPIO10, 4, 0x401F, 0x866C, 0x86C4, 1, imxrt_pad_SPI_B0_04_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_05_AF[1] = {
    { 0, 0x0000, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B0_05 = { GPIO10, 5, 0x401F, 0x8670, 0x86C8, 1, imxrt_pad_SPI_B0_05_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_06_AF[1] = {
    { 0, 0x8738, 2 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B0_06 = { GPIO10, 6, 0x401F, 0x8674, 0x86CC, 1, imxrt_pad_SPI_B0_06_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_07_AF[1] = {
    { 0, 0x8744, 1 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B0_07 = { GPIO10, 7, 0x401F, 0x8678, 0x86D0, 1, imxrt_pad_SPI_B0_07_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_08_AF[1] = {
    { 0, 0x8750, 2 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B0_08 = { GPIO10, 8, 0x401F, 0x867C, 0x86D4, 1, imxrt_pad_SPI_B0_08_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_09_AF[1] = {
    { 0, 0x872C, 2 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B0_09 = { GPIO10, 9, 0x401F, 0x8680, 0x86D8, 1, imxrt_pad_SPI_B0_09_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_10_AF[1] = {
    { 0, 0x873C, 2 },    // FLEXSPI2
};
