openmv/openmv/src/hal/mimxrt/MIMXRT1062/drivers/mimxrt_pads.c
const imxrt_pad_t imxrt_pad_SPI_B0_10 = { GPIO10, 10, 0x401F, 0x8684, 0x86DC, 1, imxrt_pad_SPI_B0_10_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_11_AF[1] = {
    { 0, 0x8740, 1 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B0_11 = { GPIO10, 11, 0x401F, 0x8688, 0x86E0, 1, imxrt_pad_SPI_B0_11_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_12_AF[1] = {
    { 0, 0x8734, 2 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B0_12 = { GPIO10, 12, 0x401F, 0x868C, 0x86E4, 1, imxrt_pad_SPI_B0_12_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B0_13_AF[0] = {
};
const imxrt_pad_t imxrt_pad_SPI_B0_13 = { GPIO10, 13, 0x401F, 0x8690, 0x86E8, 0, imxrt_pad_SPI_B0_13_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B1_00_AF[1] = {
    { 0, 0x872C, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B1_00 = { GPIO10, 14, 0x401F, 0x8694, 0x86EC, 1, imxrt_pad_SPI_B1_00_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B1_01_AF[1] = {
    { 0, 0x873C, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B1_01 = { GPIO10, 15, 0x401F, 0x8698, 0x86F0, 1, imxrt_pad_SPI_B1_01_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B1_02_AF[1] = {
    { 0, 0x8738, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B1_02 = { GPIO10, 16, 0x401F, 0x869C, 0x86F4, 1, imxrt_pad_SPI_B1_02_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B1_03_AF[1] = {
    { 0, 0x8734, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B1_03 = { GPIO10, 17, 0x401F, 0x86A0, 0x86F8, 1, imxrt_pad_SPI_B1_03_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B1_04_AF[1] = {
    { 0, 0x8730, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B1_04 = { GPIO10, 18, 0x401F, 0x86A4, 0x86FC, 1, imxrt_pad_SPI_B1_04_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B1_05_AF[1] = {
    { 0, 0x8750, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B1_05 = { GPIO10, 19, 0x401F, 0x86A8, 0x8700, 1, imxrt_pad_SPI_B1_05_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B1_06_AF[1] = {
    { 0, 0x0000, 0 },    // FLEXSPI2
};
const imxrt_pad_t imxrt_pad_SPI_B1_06 = { GPIO10, 20, 0x401F, 0x86AC, 0x8704, 1, imxrt_pad_SPI_B1_06_AF };

static const imxrt_pad_af_t imxrt_pad_SPI_B1_07_AF[0] = {
};
const imxrt_pad_t imxrt_pad_SPI_B1_07 = { GPIO10, 21, 0x401F, 0x86B0, 0x8708, 0, imxrt_pad_SPI_B1_07_AF };

static const imxrt_pad_af_t imxrt_pad_WAKEUP_AF[1] = {
    { 7, 0x8568, 1 },    // NMI
};
const imxrt_pad_t imxrt_pad_WAKEUP = { GPIO5, 0, 0x400A, 0x8000, 0x8018, 1, imxrt_pad_WAKEUP_AF };

static const imxrt_pad_af_t imxrt_pad_PMIC_ON_REQ_AF[1] = {
    { 0, 0x0000, 0 },    // SNVS
};
const imxrt_pad_t imxrt_pad_PMIC_ON_REQ = { GPIO5, 1, 0x400A, 0x8004, 0x801C, 1, imxrt_pad_PMIC_ON_REQ_AF };

static const imxrt_pad_af_t imxrt_pad_PMIC_STBY_REQ_AF[1] = {
    { 0, 0x0000, 0 },    // CCM
};
const imxrt_pad_t imxrt_pad_PMIC_STBY_REQ = { GPIO5, 2, 0x400A, 0x8008, 0x8020, 1, imxrt_pad_PMIC_STBY_REQ_AF };
